In [5]:
with open("BClist.txt","r") as file:
    str=file.read()

In [6]:
l1=str.split('\n')

In [7]:
l2=[]
for i in l1:
    lst1=[]
    lst2=i.split('|')
    for j in range(len(lst2)):
        if lst2[j]!='':
            lst1.append(lst2[j].strip())
    l2.append(lst1)

In [8]:
import pandas as pd

In [9]:
df=pd.DataFrame(l2)

In [10]:
df

       0       1                             2     3    4
0      1  230012                   AARAV OSWAL   MTH  CSE
1      2  231065                    SUVID GOEL    EE  CSE
2      3  230015                    AARSH JAIN   MTH  CSE
3      4  230017         AARUSH NARENDRA GHATE    EE  CSE
4      5  230293                BHAVNOOR SINGH    ME  CSE
..   ...     ...                           ...   ...  ...
100  101  230288  BHARAMBE SARVESH PURUSHOTTAM   PHY   CE
101  102  230138                ANIKEIT KHANNA  BSBE   CE
102  103  231106                UDIT CHOUDHARY   PHY   CE
103  104  230366                   DHRUV KUMAR   PHY   CE
104  105  231150                   VIKAS MEENA    AE   CE

[105 rows x 5 columns]

In [11]:
df=df.rename(columns={0:'SN',1:'RollNo',2:'NAME',3:'OldBranch',4:'NewBranch'})

In [12]:
df=df.drop('SN',axis=1)

In [13]:
df

     RollNo                          NAME OldBranch NewBranch
0    230012                   AARAV OSWAL       MTH       CSE
1    231065                    SUVID GOEL        EE       CSE
2    230015                    AARSH JAIN       MTH       CSE
3    230017         AARUSH NARENDRA GHATE        EE       CSE
4    230293                BHAVNOOR SINGH        ME       CSE
..      ...                           ...       ...       ...
100  230288  BHARAMBE SARVESH PURUSHOTTAM       PHY        CE
101  230138                ANIKEIT KHANNA      BSBE        CE
102  231106                UDIT CHOUDHARY       PHY        CE
103  230366                   DHRUV KUMAR       PHY        CE
104  231150                   VIKAS MEENA        AE        CE

[105 rows x 4 columns]

In [14]:
df['OldBranch'].value_counts()

OldBranch
CE      19
CHM     18
ES      17
BSBE    11
PHY      8
AE       7
ME       6
CHE      5
MTH      4
ECO      4
MSE      4
EE       2
Name: count, dtype: int64

In [15]:
df['NewBranch'].value_counts()

NewBranch
BSBE    16
CE      14
CHE     11
ECO     10
ME       9
AE       9
MTH      8
EE       8
MSE      7
CSE      6
SDS      4
PHY      3
Name: count, dtype: int64

#### Search by Student's Name

In [ ]:
x=input()
df[df['NAME'].str.contains(x.upper())].reset_index(drop=True)

#### Search by Student's Old Branch

In [ ]:
x=input()
df[df['OldBranch'] == x.upper()].reset_index(drop=True)

#### Search by Student's New Branch

In [ ]:
x=input()
df[df['NewBranch'] == x.upper()].reset_index(drop=True)

#### Search by Student's Old Branch and New Branch

In [ ]:
x=input()
y=input()
df[(df['OldBranch'].str.upper() == x.upper()) & (df['NewBranch'].str.upper() == y.upper())].reset_index(drop=True)